print('Ім\'я:\tВасиль')
print('Прізвище:\tНікітюк')

повідомлення = input('Введіть повідомлення: ')
print('Ваше повідомлення:\n', повідомлення)

'''

    Розробити програму, яка запитує у користувача ім'я. Після введення імені
    програма вітає користувача по імені.
    
    Наприклад:
    
    Введіть своє ім'я: Василь
    Привіт, Василь!

'''

name = input('Введіть своє ім\'я: ')
print('Ваше ім\'я: ', name)

print('Ваше повідомлення: ', input('Введіть повідомлення: '))

print('Nothing\nwill work unless you do')
