# while True:
#     number = input('Введіть число: ')
#
#     if number.isnumeric():
#         number = float(number)
#         break
#     else:
#         print('Ви ввели некоректне число!')
#
# print(number)

lorem = "lOREM ipsum dolor sit amet, consectetur dolor adipiscing dolor elit"

lorem = lorem.capitalize()

print(lorem[-1::])
print(lorem.find('dolor', 41))
print(lorem.lower().count('dolor'))


'''
    Програма запитує у користувача його ім'я. Введені дані перевіряються на коректність
    (якщо ім'я написано некоректно – програма просить ввести ще раз і так до тих пір, доки
    ім'я не буде коректним).
    
    Після того, як буде введено коректне ім'я, його треба відформатувати і вивести. Перша літера імені
    має бути великою, а всі інші — маленькими.
    
    УСКЛАДНЕННЯ:
    Програма має запитувати прізвище, ім'я та по батькові. Всі дані мають перевірятися на коректнісь.
    Після введення всіх даних необхідно сформувати введені дані у форматі прізвища та ініціалів.
    
    Приклад:
    Прізвище: пЕТРОВ
    Ім'я: іВАн
    По батькові: вОлОдИмИрович
    
    Петров І.В.
'''