number = int(input('Введіть число:'))

if 99999 < number < 1000000:
    num_1 = number % 10
    num_2 = (number // 10) % 10
    num_3 = (number // 100) % 10
    num_4 = (number // 1000) % 10
else:
    print('Помилка')

print(num_4, num_3, num_2, num_1)
print(f'{num_4}{num_3}{num_2}{num_1}')

'''

    Зробити вікторину на вільну тему.
    Має бути 10 запитань з 4-ма варіантами відповіді.
    
    В кінці програма має вивести кількість правильних
    відповідей і коментар до результату (не меньше 4-х варіантів
    коментарів). 


'''